In [1]:
import pandas as pd

In [9]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, ['l1', 'l2', 'l3', 'l4'], 'c1 c2 c3 c4'.split())

# Formas de seleções

## 1. Seleções com colchetes []

In [13]:
# o dataframe criado
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [15]:
# selecionando uma coluna (retorna uma series)
df['c2']

l1     2
l2     6
l3    10
l4    14
Name: c2, dtype: int64

In [19]:
# selecionando mais de uma coluna (retorna um df) (precisam estar num array)
df[['c1', 'c2']]

    c1  c2
l1   1   2
l2   5   6
l3   8  10
l4  13  14

## 2. Seleções com fatiamento (slice) [:]

In [ ]:
# selecionando com a sintaxe de fatiar (slice) arrays (lists)

In [21]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [24]:
df['l2':'l4']

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [26]:
df[2:4]

    c1  c2  c3  c4
l3   8  10  11  12
l4  13  14  15  16

In [40]:
df[2:4][['c3', 'c1']]

    c3  c1
l3  11   8
l4  15  13

## 3. Seleções com métodos loc e iloc

In [43]:
# selecionando com o método "loc" (recebe os rótulos como parâmetros)

In [42]:
df.loc['l1']

c1    1
c2    2
c3    3
c4    4
Name: l1, dtype: int64

In [44]:
df.loc[['l1', 'l2']]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8

In [55]:
df.loc['l1', 'c4']

4

In [56]:
df.loc[['l3', 'l1'], ['c4','c1']]

    c4  c1
l3  12   8
l1   4   1

In [47]:
# selecionando com o método "iloc" (recebe os índice numéricos como parâmetros)

In [48]:
df.iloc[0,3]

4

In [57]:
df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   8
l1   4   1